[
  {
    "id": 147527131,
    "title": "Vibe Codingの衝撃：コードを書かないエンジニアが『言語化能力』だけで月5万の自動集金システムを作る全手順",
    "slug": "ne559d0d692a5",
    "content": "Vibe Codingの衝撃：コードを書かないエンジニアが『言語化能力』だけで月5万の自動集金システムを作る全手順\n                 \n          yukidouji.\n         2026年2月19日 09:46     「エンジニアなら、自分でコードを書け」そんな常識は、2026年の今、音を立てて崩れ去ろうとしています。毎日、終わらない受託案件の仕様変更に対応し、他人の書いた複雑なコードのデバッグに追われる。 「技術力さえあれば、いつか報われる」と信じてスキルを磨いてきたけれど、ふと今の報酬と労力のバランスに疑問を感じる瞬間がある…。もしあなたがそう感じているなら、この記事はあなたのためのものです。今、シリコンバレーを中心に「Vibe Coding（バイブコーディング）」という概念が注目を集めています。 これは、コードの文法を覚えることよりも、「AIにどう指示を出せば、動くモノができるか」という言語化能力こそが、エンジニアの新たな武器になるという考え方です。この記事では、現役エンジニアである私が、実際にコードをほとんど書かずに構築した**「月5万円を稼ぐ自動集金システム」**の全貌と、そこに至るまでの実践的なプロセス（Proof of Concept）を包み隠さず公開します。なぜ今、「書かないエンジニア」が最強なのか\"Claude Code\" という黒船少し前まで、AIにコードを書かせるといっても「関数のひな形を作らせる」程度でした。 しかし、Claude 3.7 Sonnet や Claude Code の登場で、フェーズが変わりました。「Next.jsでSEOに強いブログシステムを作って。デザインはVercel風で、デプロイまでやって」 これだけの指示で、環境構築からデプロイまで完走してしまう時代です。ここで問われるのは、React.useEffect の詳細な仕様を暗記しているかではありません。 「どのようなシステムを作れば、市場価値（＝売上）になるか」 を設計し、それをAIに的確に伝える 「言語化能力」 です。これからのエンジニアの生存戦略は、「自分で書く」から「AIのエグゼクティブ・マネージャーになる」ことへとシフトしています。【実践録】AIに任せて見えた「壁」と「突破口」「じゃあ、AIに全部やらせれば楽勝ではないか」 そう思って、私も最初は安易に導入しました。しかし、そこにはいくつかの「壁」がありました。週末を費やした「無限ループ」の課題ある週末、意気揚々と「最新のニュースを収集して要約するBot」を作ろうとしました。 Claudeにざっくりとした指示を投げ、「あとは任せた」と席を外しました。戻ってみると、画面にはエラーログが表示されていました。 「修正して」と投げると、「修正しました」と返ってくるが、別の箇所で整合性が取れなくなる。 その問題を指摘すると、最初の仕様に戻ってしまう。 AIが文脈を見失い、「修正の無限ループ」に陥っていたのです。「なぜ意図が伝わらないのか」 モニターに向かって頭を抱えました。 この時点での成果物は、期待した動作には程遠い状態でした。突破口は「プロンプトの解像度」だったそこで私は気づきました。 AIの能力不足ではない。私の「指示（Vibe）」の解像度が低かったのだと。「いい感じにして」では、AIは最適な解を出せません。 「要約して」ではなく、「300文字以内で、専門用語には注釈を入れ、初学者でも分かるように要約して。出力はJSON形式で、キーは\"summary\"と\"notes\"にして」と伝える。指示の解像度を極限まで上げる。 これができた瞬間、AIは迷いを捨て、非常に高いパフォーマンスを発揮するようになりました。エンジニアの「パフォーマンス」を支える道具選びVibe Codingの本質は、AIとの対話です。 つまり、これまでコードを書いていた時間の多くが、「自然言語（日本語や英語）を構築する時間」に変わります。ここで妥協してはいけないのが、入力インターフェースと、自分自身のコンディション管理です。 思考の速度でプロンプトを打ち込み続け、Aiとクリエイティブな対話を続けるには、それ相応の「環境」が必要です。1. 脳と指を直結させる：HHKB Professional HYBRID Type-S私たちはもう、コードを書くだけではありません。「プロンプト」という名のロジックを構築し続けるのです。 そのためのインターフェースとして、私は結局これに戻ってきました。HHKB（Happy Hacking Keyboard）です。ファンクションキーすら削ぎ落とした合理的な配列は、ホームポジションから指を離さずにAIへ指示を出し続けるのに最適です。 特に「Type-S（静音モデル）」の上質な打鍵感は、思想を言語化するプロセスそのものを快適にしてくれます。 「一生使えるインターフェース」への投資は、エンジニアとしての生産性に直結します。👉 HHKB Professional HYBRID Type-S (Amazon)2. 「視覚」をリセットし、思考を整理する：めぐりズム 蒸気でホットアイマスクAIが生成するコードやログを確認する作業は、自分で書く以上に「眼」を通した情報処理能力を酷使します。 AIの微細な論理矛盾を見つけるのは、結局のところ人間の眼だからです。デバッグが難航し思考が停滞しかけた時、私は迷わずこれを活用します。 15分間、強制的に視覚情報を遮断し、温める。 すると、不思議と「システムの全体像」が整理され、解決の糸口が見つかることがあります。 エンジニアにとってのリカバリーツールとして、非常に有効です。👉 めぐりズム 蒸気でホットアイマスク (Amazon)3. 自動化の「基盤」を作る：ABLENET VPSローカルPCでBotを常時稼働させるのは、リソース管理の観点から最適解とは言えません。 排熱や電力消費の問題もあります。私が「収益化システム」を24時間安定稼働させているのは、ABLENET VPS です。 派手な広告を出していないため知る人ぞ知る存在ですが、「転送量無制限」かつ「広帯域」という、非常に実用的なスペックを持っています。 重いスクレイピング処理やAIモデルのダウンロードを走らせても、安定したパフォーマンスを維持します。 低コストで、堅牢な「自分だけのサーバー」を持つ。これが現代の自動化における賢い選択です。👉 ABLENET VPS (A8.net)\n\n\nVPS（仮想専用サーバー）｜ABLENET®\n\n\nVPS（仮想専用サーバー）ならABLENET®。高速SSD対応、申込み後すぐに試用可能でWindowsServerも選べる\n\n\npx.a8.net\n\n\n\n\n    \n    ダウンロード\n    \n  copy",
    "tags": [
      "#副業",
      "#生成AI",
      "#個人開発",
      "#ClaudeCode",
      "#vibeCoding",
      "#HHKB",
      "#AIエンジニア",
      "#エンジニア生存戦略"
    ],
    "thumbnail": "https://assets.st-note.com/production/uploads/images/252883612/rectangle_large_type_2_f55c2a778865f73b333cd853c76b39ef.png?fit=bounds&quality=85&width=1280",
    "publishedAt": "2026-02-19T09:46:13+09:00",
    "url": "https://note.com/yukidouji/n/ne559d0d692a5"
  },
  {
    "id": 147496527,
    "title": "【GitHub自動化】寝ている間にブログとXを運用させる「AI×エンジニア」の生存戦略【ソースコード公開】",
    "slug": "ned3b257ec2d4",
    "content": "【GitHub自動化】寝ている間にブログとXを運用させる「AI×エンジニア」の生存戦略【ソースコード公開】\n          \n    6\n         \n          yukidouji.\n         2026年2月19日 00:28     「ブログを書く時間がない」は嘘だ。本業のコードレビュー、終わらないMTG、そして帰り道の満員電車。家に帰って残りの気力で「技術ブログを書く」なんて、無理ゲーですよね。私もそうでした。でも、「毎日9時に勝手に記事が投稿されて、Xで拡散までしてくれるBot」がいたらどうでしょう？今回は、私が実際に運用している「Next.js + Gemini 1.5 Pro + GitHub Actions」による完全自動化システムの裏側を、生々しい失敗談と共に公開します。正直、これを作る前と後では、エンジニアとしての「発信力」と「副収入」の桁が変わりました。🚀 技術スタック：無料枠を使い倒す貧乏性な私が選んだ構成はこれです。Framework: Next.js (App Router)AI: Google Gemini 1.5 Pro (無料枠が神)Database: 記事データはJSON管理（Git管理）CI/CD: GitHub Actions (Cronで定期実行)Hosting: Vercel (Hobby Plan)サーバー代？ 0円です。API代？ Geminiの無料枠内なら0円です。なぜGeminiなのか？OpenAIのAPIも試しました。GPT-4oは確かに賢い。でも、毎日大量のトークンを食わせるこのシステムでは、APIコストだけで月数千円が吹っ飛びます。そこでGemini 1.5 Flash/Proです。特にFlashは、この用途（構成案→執筆→推敲）においては爆速かつ激安。トークンあたりのコストパフォーマンスが桁違いでした。もちろん、最初は変な日本語ばかり生成されて絶望しました。「〜ですます」と「〜だ」が混ざったり、やたらとポエム調になったり。プロンプトエンジニアリングの沼にハマり、週末を丸々2日溶かしました。（この辺りの「人間味を出させるプロンプト調整」の泥臭い話は、後半の有料部分で解説します。）💡 開発中に詰まったポイント（という名の地獄）1. VercelのTimeout制限ローカルでは完璧に動くのに、デプロイした瞬間に504 Gateway Timeout。VercelのHobbyプランには「Serverless Function 10秒制限」という壁があります。AIに記事を書かせて、OGP画像を生成して…なんてやってると、余裕で10秒超えます。解決策：処理を分割しました。「記事生成」はGitHub ActionsのCron jobで行い、生成されたJSONファイルをCommit＆Pushする方式に変更。これならVercel側は「静的ファイルをビルドするだけ」なので、タイムアウトとは無縁です。2. X（Twitter）APIの認証周りAPI v2になっても相変わらず複雑怪奇なTwitter API。OAuth 1.0aと2.0の違い、Bearer Tokenでは投稿できない罠など、一通りの地雷を踏み抜きました。ドキュメントを読み漁り、ライブラリのソースコードまで追いかけて、ようやく「自動投稿」が成功した瞬間の脳汁は忘れられません。🛠 必須ツール：これがないと開発効率が半分になるこのBot開発に限らず、個人開発をする上で「これだけはケチるな」というツールがあります。1. 安定した開発環境：ConoHa VPS実は、GitHub Actionsの無料枠（月2000分）を超えそうになったときのために、バックアップとして一番安いVPSを契約しています。Cronジョブを自前で回せる安心感は異常です。また、Botのログ監視や一時的なデータ置き場としても重宝しています。👉 ConoHa VPSを見てみる（※一番安いプランで十分です。月数百円で「自分だけのLinuxサーバー」が手に入るのはデカい。）\n\n\n超高速レンタルサーバーならConoHa WING｜初期費用・最低利用期間なし\n\n\n【国内最速】の超高速レンタルサーバーConoHa WING！最新の高性能サーバー・超高速SSD・高速化技術で圧倒的な速さを\n\n\npx.a8.net\n\n\n\n\n2. 作業効率爆上げの相棒：ロジクール MX Keys開発中、AIの出力結果を修正したり、プロンプトを微調整したりと、意外と「文字を打つ」作業量が膨大になります。以前使っていた安物のキーボードでは手首が悲鳴を上げていましたが、これに変えてから腱鞘炎知らずです。打鍵感が気持ちよすぎて、無駄にコメントを書きたくなります。👉 ロジクール MX Keys (Amazon)（※作業のお供には「ラムネ」も必須です。脳のブドウ糖枯渇対策に。）    \n    ダウンロード\n    \n  copy",
    "tags": [
      "#エンジニア",
      "#自動化",
      "#個人開発",
      "#nextjs",
      "#GitHubActions",
      "#GeminiAPI"
    ],
    "thumbnail": "https://assets.st-note.com/production/uploads/images/252833790/rectangle_large_type_2_454cf96410ab39e7ab7ebf47fbcb98ad.png?fit=bounds&quality=85&width=1280",
    "publishedAt": "2026-02-19T00:28:00+09:00",
    "url": "https://note.com/yukidouji/n/ned3b257ec2d4"
  },
  {
    "id": 147296077,
    "title": "【実験】Google Antigravityで重力を崩壊させたら、なぜか「私の声」がロボット化した話",
    "slug": "n6c71e83365a8",
    "content": "Photo by\n    \n      eri_oka\n       \n      【実験】Google Antigravityで重力を崩壊させたら、なぜか「私の声」がロボット化した話\n          \n    1\n         \n          yukidouji.\n         2026年2月17日 17:39     こんにちは、yukidoujiです。先日、Google Antigravityの挙動検証として、物理演算オブジェクトを大量に発生させる「限界負荷テスト」を行っていました。 ブラウザのフレームレートがどこまで落ちるか、メモリがいつ溢れるかを見守っていたのですが、予想外の場所でクラッシュが発生しました。ブラウザのメインスレッドではありません。 バックグラウンドで動かしていた、OS標準の「AIノイズキャンセリング機能」が真っ先に死んだのです。GPUリソースの「隠れた奪い合い」現象としてはこうです。 Antigravityでオブジェクト数が一定を超え、GPU使用率が100%に張り付いた瞬間、同時に接続していたDiscordの通話相手から「声がロボットみたいになってる」「ノイズが酷い」と指摘されました。原因を深掘りして、タスクマネージャーとGPUプロファイラを並べて睨めっこしたところ、面白い（そして厄介な）事実が見えてきました。Antigravity (WebGL): 描画と物理演算のためにGPUのシェーダーユニットとVRAM帯域を限界まで占有。OSのAI音声処理: ノイズ除去のために、同じGPUのTensorコア（あるいは演算ユニットの一部）を使おうとする。競合発生: 優先度の高い描画プロセスにリソースを奪われ、音声処理のリアルタイム性が維持できず、バッファアンダーラン（音飛び・ロボット化）が発生。「AI PC」の物理的な限界最近のPCは「AI搭載」を謳い、NPU（Neural Processing Unit）や強力なGPUを搭載しています。 しかし、結局のところ、それらは「電力」「メモリ帯域」「熱設計電力（TDP）」という物理的な財布を共有している運命共同体です。ブラウザの中で「重力」を少し激しくいじっただけで、OSレベルの機能であるマイク入力が不安定になる。 これは、ハードウェア側で「AI処理専用のレーン（完全に独立した帯域と電源）」が確立されるまでは、我々エンジニアにつきまとう「リソース配分（Resource Allocation）」という古くて新しい悩みそのものです。「AIが何でもやってくれる」と言いますが、そのAIを動かすためのリソース管理は、まだ人間が泥臭くケアしなければならないのが現状のようですね。    \n    ダウンロード\n    \n  copy",
    "tags": [
      "#AI技術",
      "#gpu",
      "#技術ブログ",
      "#GoogleAntigravity",
      "#エンジニアの日常"
    ],
    "thumbnail": "https://assets.st-note.com/production/uploads/images/252818596/rectangle_large_type_2_ac35b3b6e9e7469b71c35682ff5ac69b.png?fit=bounds&quality=85&width=1280",
    "publishedAt": "2026-02-17T17:39:46+09:00",
    "url": "https://note.com/yukidouji/n/n6c71e83365a8"
  }
]