[
  {
    "id": 148023287,
    "title": "SaaSは本当に終わるのか？「アンソロピック・ショック」の正体と、これからの生存戦略",
    "slug": "n0e1a4117bd8d",
    "content": "SaaSは本当に終わるのか？「アンソロピック・ショック」の正体と、これからの生存戦略\n                 \n          yukidouji.\n         2026年2月22日 18:04     はじめに：100兆円が消えた日先日、エンジニア界隈と投資家たちを震撼させるニュースが駆け巡りました。Anthropicの関係者が放った「AIエージェントの進化により、多くのソフトウェア・サービス（SaaS）はその存在意義を失い、終焉を迎える」という趣旨の発言です。これに呼応するかのように、セールスフォースやマイクロソフトといった名だたるソフトウェア企業の株価が急落。市場から一気に数百億ドル（数兆〜数十兆円）もの時価総額が吹き飛ぶ「SaaS大暴落（SaaSpocalypse）」が起きました。「SaaSは終わった」「これからはAIエージェントが全てを代替する」ーー。 果たしてこの予測は正しいのでしょうか？それとも、実務を語るにはあまりに時期尚早なのでしょうか？第1の壁：「業務フローを舐めるな」というエンジニアの叫びこの議論に対して、現場のエンジニアや実務家からは強い反発も起きています。 「エクセルと秘伝のタレ（独自ルール）、そして暗黙知で塗り固められた日本の複雑な業務フローを舐めるな」という意見です。確かに、クロードのようなAIがデスクトップを自在に操作できるようになっても、企業ごとに異なる「承認ルート」や「例外処理」の網の目を、AIが完璧に自律して泳ぎ切るのはまだ困難です。これまでのSaaSは、単なる「ツール」ではなく、バラバラだった業務を「型（標準プロセス）」に落とし込むための装置でもありました。その「型」を捨てて自由奔放なAIエージェントに回帰するのは、組織運営の観点からは退化に見えるかもしれません。第2の壁：崩壊する「ユーザー数課金」のロジックしかし、Anthropicが突きつけた刃は別のところにあります。それはビジネスモデルの根幹、「ユーザー数に応じた課金体系（シート制）」の終焉です。従来、SaaSの売上は「使う人間の数 × 単価」で計算されてきました。しかし、AIエージェントが1人で100人分の「人間らしい操作」をこなせるようになれば、企業はわずか数名分のIDで全業務を完結できてしまいます。市場がパニックに陥ったのは、「AIがSaaSを殺すから」ではなく、**「SaaS企業がこれまでのような方法でお金を稼げなくなるから」**なのです。結論：SaaSは「次世代のデータ基盤」へ進化する私は、SaaSは死なないと考えています。ただし、その姿は劇的に変わります。これからのSaaSは、人間が操作画面をポチポチするものから、**AIエージェントがプログラム経由でデータを読み書きする「エージェント専用のバックエンド基盤」**へと純化していくはずです。以前: 人間がSaaSを開き、商談を入力する。今後: AIエージェントがチャットの会話や会議の録画から判断し、裏側でSaaSのデータを更新する。ユーザーが見るのはSaaSの画面ではなく、手元で動くAIエージェントのインターフェースだけ。SaaS各社は、その「信頼できるデータ置き場」としての価値を研ぎ澄ませる競争に入ります。おわりに：エンジニアが今すべきこと「SaaS対AIエージェント」という対立構造で考えるのは、もう終わりです。 私たちは今、**「AIエージェントという新しいユーザー（顧客）」**のために、どうやって効率的なシステムを再設計するかという、刺激的な時代の入り口に立っています。「業務フローを舐めるな」と守るのではなく、その複雑な業務フローをAIが理解できる形に「言語化・整理」できる人こそが、これからのAI時代に最も必要とされるマネージャー、そしてエンジニアになるのではないでしょうか。もしこの記事が面白いと思ったら、ぜひ「スキ」やシェアをお願いします！ AIマネジメントや最新の技術トレンドについて、引き続き発信していきます。    \n    ダウンロード\n    \n  copy",
    "tags": [
      "#エンジニア",
      "#Claude",
      "#SaaS",
      "#AIエージェント",
      "#未来予測",
      "#Anthropic",
      "#SaaS終焉論"
    ],
    "thumbnail": "https://assets.st-note.com/production/uploads/images/253739710/rectangle_large_type_2_a64a6eee8ceb6dd5418ab9c4cb691e55.png?fit=bounds&quality=85&width=1280",
    "publishedAt": "2026-02-22T18:04:16+09:00",
    "url": "https://note.com/yukidouji/n/n0e1a4117bd8d"
  }
]